package homework;

import java.util.Scanner;

public class damashka16 {
    /**Напишите программу, который принимает с клавиатуры целое
    число и выводит на экран его квадрат, но только в случае, если
    введенное число отрицательно. В противном случае - на экран
    выводится сообщение Ошибка.*/
    public static void main(String[] args) {
        // Клавиатурадан бүтүн санды алуу
        Scanner scanner = new Scanner(System.in);
        System.out.print("Бутун санды киргизиниз: ");
        int number = scanner.nextInt();

        // ПСан терс болсо, аны кайталайбыз
        if (number < 0) {
            int square = number * number;
            System.out.println("Квадрат сан: " + square);
        } else {
            System.out.println("Ката. Терс эмес сан киргизилген.");
        }

    }
}

/**Тергич киргизүүнү алуу үчүн колдонулат.
        System.out.("бүтүн санды киргизиңиз: "); киргизүү үчүн чакырууну чыгарат.
int number = scanner.(); клавиатурадан бүтүн санды окуйт жана аны өзгөрмөгө сактайт п.
 Менен (менен < 0) киргизилген Сан терс экендигин текшерет.
 Эгерде Сан терс болсо, анда программа ошол сандын квадратын эсептейт (с = караңыз * караңыз;) жана натыйжаны чыгарат.
 Эгер Сан терс эмес болсо (нөлдөн кем эмес), программа ката жөнүндө кабар берет.*/
